using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace laba_6
{
	//		Написати програму, що виконує наступні функції(ВИКОНАТИ ВСІ 8 (ВІСІМ) ПУНКТІВ) :
//1.	Виводить на екран введене число з клавіатури в зворотному порядку(1234->4321)
//2.	Виводить будь-яку строку в зворотному порядку(АБВ->ВБА)
//3.	Дробові числа виводяться в зворотному порядку і ціла частина і дробова(123.456->321.654)
//4.	Виводити будь-яку строку в зворотному порядку і всі елементи після “магічного знаку” теж в зворотному(АБВ, ГДЕ->ВБА, ЕДГ)
//5.	Реалізувати пункти 1-4 за допомогою методів, перевантаживши методи для різних типів
//6.	Реалізувати пункти 1-4 за допомогою рекурсії, методи для різних типів перевантажити
//7.	Реалізувати метод, що буде масив повертати задом навпаки(Використання Array.Reverse() заборонено!)
//8.	Виконати пункт 7 з використанням ключових слів ref i out
	class Program
	{
		public static void Main()
		{
			LAB_6 obj = new LAB_6();
			int [] array = new int [] { 23, 24, 2121 };
			int[] array1;
			Console.WriteLine("Введiть потрiбну iнформацiю : ");
			obj.Revers(array, out array1);
		}
	}
}
